Revit 2024 API
CentralModelContentionException.CurrentUser Property
Retrieves current user name.
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string CurrentUser { get; }
Visual Basic
Public ReadOnly Property CurrentUser As String
	Get
Visual C++
public:
property String^ CurrentUser {
	String^ get ();
}
See Also
CentralModelContentionException Class
Autodesk.Revit.Exceptions Namespace